<i18n src="./Reviews.yml" />
<template>
  <div class="columns reviews">
    <Background
      class="reviews-background"/>
    <div class="column">
      <Heading class="is-red">
        {{ $t('title') }}
      </Heading>
    </div>
    <div class="reviews-content column is-right">
      <Slider
        class="diplomas-section-content"
        :with-button="false"
        :class="{'is-thin': isRussianLocale}"
        :slides="reviews[locale]"/>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue';
import {localeMixin} from '@/components/common/mixins/locale.mixin';
export default Vue.extend({
  name: 'Reviews',
  mixins: [localeMixin],
  computed: {
    reviews() {
      return {
        en: [
          { id: 1,
            name: 'Отзывы',
            text: `Первое, о чем хочется сказать, как же трудно решиться на терапию. Перестать себе рассказывать,
                  что справишься сама, что не можешь сейчас позволить, что как-то жила и не померла и вообще
                  хватит ныть. Сложно признать, что нужна помощь и что боишься. Всего. Будущего, Прошлого и
                  Настоящего. Мира вокруг. Что не сможешь измениться и еще страшнее, что изменишься навсегда.
                  И мир вокруг тебя тоже безвозвратно изменится. Второе - как непросто найти "своего" терапевта.
                  Человека и специалиста. Кому сможешь довериться, будешь уверен, что он с тобой и за тебя. Что
                  он знает, все получится, если продолжать. Поддерживает тебя бережно, но твердо направляет, не
                  дает ускользнуть. Верит в тебя. С которым не страшно пройти через долгий и порой очень
                  трудный путь в обретении себя. Перед которым можно, (и хорошо бы) плакать, на которого
                  можно злиться, это, оказывается, тоже можно и нужно) Позволить быть слабым, быть глупым,
                  показать свой стыд и ужас. Чтобы понять, принять и полюбить любым... себя. Прожить заново все,
                  что не давало покоя десятилетиями, отпустить то, что, казалось, невозможно отпустить. Мне очень
                  повезло, я искала и нашла Лену. И вот уже несколько лет мы работаем и я учусь быть собой с ее
                  помощью. Был перерыв, мы заканчивали и снова начинали. И я счастлива, что решилась начать и
                  продолжить. И что это было именно с Леной. Длительная терапия это не только про трудности,
                  боль, слезы и прочие "радости") Я боялась и сопротивлялась внутренне именно этому. Но, как
                  оказалось, терапия - это про поддержку, про силу, которую вдруг ощущаешь, идя домой после
                  сеанса. Про умиротворение и радость прозрения. Про инсайты, такие неожиданные и сильные. А
                  еще про недоумение, про то, как не понимала раньше, как это я не видела очевидного, почему?
                  Вот же оно, вот все просто и логично и все теперь будет по-другому. Лучше и проще, увереннее и
                  спокойнее... И как же увлекательно оглянуться назад и вдруг понять, что настоящий ты вот сейчас
                  или уверенно идешь к Себе. Что твои установки, страхи, все, что управляло тобой годами - не ты.
                  Что чувствуешь - так это свободу. И появляются силы брать на себя ответственность. Оказывается,
                  это так здорово) Счастье - становиться хозяином и творцом своей жизни. Ради этого, несомненно,
                  стоит тратить время, силы и деньги. Спасибо, Лена, большое. И мне прошлой спасибо, что
                  решилась, и мне сегодняшней, что иду дальше. Это мой самый лучший подарок самой себе.`,
            date: 'Марина'
          },
        ],
        ru: [
          {
            id: 2,
            name: 'Отзывы',
            text: `Первое, о чем хочется сказать, как же трудно решиться на терапию. Перестать себе рассказывать,
                  что справишься сама, что не можешь сейчас позволить, что как-то жила и не померла и вообще
                  хватит ныть. Сложно признать, что нужна помощь и что боишься. Всего. Будущего, Прошлого и
                  Настоящего. Мира вокруг. Что не сможешь измениться и еще страшнее, что изменишься навсегда.
                  И мир вокруг тебя тоже безвозвратно изменится. Второе - как непросто найти "своего"; терапевта.
                  Человека и специалиста. Кому сможешь довериться, будешь уверен, что он с тобой и за тебя. Что
                  он знает, все получится, если продолжать. Поддерживает тебя бережно, но твердо направляет, не
                  дает ускользнуть. Верит в тебя. С которым не страшно пройти через долгий и порой очень
                  трудный путь в обретении себя. Перед которым можно, (и хорошо бы) плакать, на которого
                  можно злиться, это, оказывается, тоже можно и нужно) Позволить быть слабым, быть глупым,
                  показать свой стыд и ужас. Чтобы понять, принять и полюбить любым... себя. Прожить заново все,
                  что не давало покоя десятилетиями, отпустить то, что, казалось, невозможно отпустить. Мне очень
                  повезло, я искала и нашла Лену. И вот уже несколько лет мы работаем и я учусь быть собой с ее
                  помощью. Был перерыв, мы заканчивали и снова начинали. И я счастлива, что решилась начать и
                  продолжить. И что это было именно с Леной. Длительная терапия это не только про трудности,
                  боль, слезы и прочие "радости") Я боялась и сопротивлялась внутренне именно этому. Но, как
                  оказалось, терапия - это про поддержку, про силу, которую вдруг ощущаешь, идя домой после
                  сеанса. Про умиротворение и радость прозрения. Про инсайты, такие неожиданные и сильные. А
                  еще про недоумение, про то, как не понимала раньше, как это я не видела очевидного, почему?
                  Вот же оно, вот все просто и логично и все теперь будет по-другому. Лучше и проще, увереннее и
                  спокойнее... И как же увлекательно оглянуться назад и вдруг понять, что настоящий ты вот сейчас
                  или уверенно идешь к Себе. Что твои установки, страхи, все, что управляло тобой годами - не ты.
                  Что чувствуешь - так это свободу. И появляются силы брать на себя ответственность. Оказывается,
                  это так здорово) Счастье - становиться хозяином и творцом своей жизни. Ради этого, несомненно,
                  стоит тратить время, силы и деньги. Спасибо, Лена, большое. И мне прошлой спасибо, что
                  решилась, и мне сегодняшней, что иду дальше. Это мой самый лучший подарок самой себе.`,
            date: 'Радда'
          },
          {
            id: 3,
            name: 'Отзывы',
            text: `В первую очередь хочу поблагодарить Елену и подругу, которая поделилась со мной ее контактами.
                  Во-вторых, считаю, что каждому из нас нужно хотя бы раз какой-то период времени походить к психологу. В нашем обществе почему-то заведено, что большие суммы денег тратятся на квартиры, машины, вещи, но никто не хочет тратить деньги на ментальное здоровье, а это намного важнее...
                  Когда я шла на первый приём, у меня даже как будто конкретного запроса не было, просто чувствовала, что в моей жизни что-то не так. Спустя полгода я уже чуть больше поняла, что у меня были за проблемы, ну и конечно, мы с Еленой многие проработали.
                  Елена научила меня распознавать чувства и эмоции, правильно их выражать; объяснила, как расставлять границы; мы проработали некоторые детские травмы и многое другое.
                  Я считаю, что до этого я как будто бы жила с выключенным светом, вроде, и понятно более-менее, но в темноте ориентироваться сложно. А сейчас свет включили, и пришла ясность.
                  И ещё я перестала болеть, хотя это случалось раньше со мной постоянно (привет всем, кто верит или не верит в психосоматику).
                  Конечно, нужно также понимать, что работа с психологом, это труд. И не всегда приятный, если обсуждаются какие-то сложные моменты. Но в основном могу сказать, что я жду встреч всегда с нетерпением.
                  Мне также очень нравится ходить к Елене, потому что помимо решения каких-то вопросов, я чувствую, что я развиваюсь. Мне очень нравится понимать, как работает наше сознание, а также это очень помогает в работе, так как на работе я постоянно контактирую с разными людьми.`,
            date: 'Алина'
          },
          {
            id: 4,
            name: 'Отзывы',
            text: `Моя уже многолетняя работа с Леной — это не только надежная платформа для работы над собой, но и «скорая помощь» в кризисных ситуациях.
                  Моя жизнь полна разнообразных кризисов. :)Тем не менее, каждый кризис благодаря нашей совместной работе — это своего рода перерождение. Изначально шокирующая, болезненная и пугающая ситуация в процессе нашей работы перестает восприниматься как угроза жизни. Психотерапия помогает мне проживать эти моменты, идентифицировать мои зоны роста, отличая настоящие факторы риска от паники, и принимать адекватные решения в состоянии осознанности.
                  Мне очень нравится, что Лена культивирует самодостаточность и ответственность. В результате нашей работы я научилась видеть границы, в особенности определять то, на что я не могу повлиять, а на что могу. И я стала больше опираться на себя, фокусироваться на том, что лежит в зоне моих возможностей и потребностей, здесь и сейчас.
                  Моя работа с Леной — это пластичный и крайне эмоциональный процесс, в котором я тем не менее чувствую себя безопасно; сессия за сессией амплитуда волнений постепенно снижается и мое состояние стабилизируется.
                  С этого момента я понимаю, что зародился мой новый уникальный опыт. Опыт человека, который уже чуть больше «знает жизнь», твердо стоит на ногах, который вышел из позиции жертвы, стал более внимателен к себе и к окружающему миру, и главное - пользуется своим правом быть творцом своей жизни.`,
            date: ''
          },
          {
            id: 5,
            name: 'Отзывы',
            text: `К Лене мы с мужем ходим на семейную терапию. Совместная терапия помогает услышать другу друга в сложных ситуациях, учит договариваться даже в простых бытовых вопросах.
                    На сеансе Лена задаёт нужные вопросы, чтобы лучше понять партнёра, его эмоции. Постепенно после терапии мы оба учимся
                   решать некоторые вопросы самостоятельно, передоговариваться.
                   С годами не накапливаются проблемы и не растёт раздражение, что способствует здоровым
                   отношениям в паре. После семейной терапии вы выходите со свежей головой, готовые к новым совместным достижениям.`,
            date: 'Дарья'
          },
          {
            id: 6,
            name: 'Отзывы',
            text: `Предательство. Полноценное такое и от самого близкого и родного человека...
                   Я пришла к Елене прожить боль, пронзительную и как тогда казалось бесконечную.
                   Случилось необратимое в моем нерушимом с мужем мире. У него родился ребёнок с другой женщиной, у дочери которой он же был крестным. Я не замечала до последнего, потому что в моем мире подобное невозможно и подрыва доверия от человека, на руках которого умер мой отец, с кем прожили 17 лет с 17-ти лет, с кем переезжали в другой город, вырастали профессионально, были опорой друг другу и растили дочь - я не могла представить даже в страшном сне. Самооценка как женщины рухнула, я никак не могла поверить, что меня можно на кого-то променять... так подло исподтишка и глупо. Поверить, что все происходит наяву было трудно. 15.03.2019 года - день, с которого началась моя новая жизнь - так красиво назвала это событие девушка, познакомившая меня с психотерапевтом и посоветовавшая отметить его в календаре. Я училась проживать чувства и эмоции, идентифицировать их, давать себе время, прикладывать усилия по спасению себя же. Принять решение, развестись, определиться, перестать сожалеть, цепляться за воздух и бесконечно рыдать, выйти на новый уровень развития своего сознания, повзрослеть, взглянуть со стороны трезвыми глазами было главным для меня в терапии.
                   Спасибо за ту опору и не побоюсь этого слова часть жизни, прожитую со мной длинною в почти год,
                   поддержку и костыль, благодаря которым удалось снова расправить крылья.
                   Это жизнь! В ней бывает все! Теперь я это точно знаю :)`,
            date: 'Александра'
          },
          {
            id: 7,
            name: 'Отзывы',
            text: `Впервые обратился к Елене в 2015 году с проблемой в личных отношениях.
                   Елена помогла мне по-новому взглянуть на некоторые важные моменты, о которых я не задумывался ранее.
                   За несколько лет терапии мы проработали множество моих запросов. Они касались в том числе моих отношений с родственниками,
                   а так же коллегами и руководством на работе. Терапия помогла мне яснее осознавать свои чувства и желания, что позволяет
                   мне увереннее держаться в критических ситуациях. Кроме того, во многом благодаря Елене я обнаружил свой интерес к практике
                   гештальт-терапии. В настоящее время обучаюсь на второй ступени МГИ.
                   Охотно рекомендую Елену как специалиста своим знакомым, особо отмечая ее бережное обращение с клиентом.`,
            date: 'Дмитрий'
          },
          {
            id: 8,
            name: 'Отзывы',
            text: `Обратилась впервые 5 лет назад с нарушением сна. Оказалось, что дело вовсе не в работе и переутомлении...
                   Сон благополучно вернулся, спасибо Лене огромное). С тех пор, периодически обращаюсь в сложных жизненных ситуациях или отношениях.
                   Считаю Лену компетентным и опытным специалистом.  Многократно рекомендовала ее друзьям и знакомым.`,
            date: 'Елена'
          },
          {
            id: 9,
            name: 'Отзывы',
            text: `Для меня терапия — это одновременно и отдых, и работа. Оба эти процесса ресурснозатратные.
                   Но благодаря Елене моя терапия проходит максимально комфортно и продуктивно.
                   Когда я только пришла на терапию, 1,5 года назад, была уверена, что мое депрессивное состояние — это я,
                   и что мой максимум — это научиться в нем существовать.
                   Сейчас я не только хочу жить, но и учусь обращать внимание на свои потребности и чувства, осознавать их.
                   А Лена помогает мне, каждую сессию.
                   На подобные изменения нужно время (не одна и не две сессии)-не бойтесь уделить его заботе о себе!`,
            date: 'Дина'
          },
          {
            id: 10,
            name: 'Отзывы',
            text: 'Я хожу к Елене с 2016 года. И это не значит, что у меня вырабаталась привычка и я не могу обходиться без психолога. ' +
              'Хороший психолог, как хороший тренер и наставник, помогает посмотреть на себя в новой перспективе. ' +
              'Я был уверен что хорошо себя знаю, но каждый раз, вместе с Еленой нахожу новые ответы на, как казалось, давно отвеченные вопросы. ' +
              'Этот более широкий вгляд помогает мне во всех областях жизни. Чем дольше я посещаю Елену, ' +
              'тем сложнее становится ее работа, ведь я больше узнаю себя, но Елена, как настоящий профессионал, не перестает прогрессировать ' +
              'и совметная работа с ней не перестает быть плодотворной.',
            date: 'Артур'
          }
        ]
      }
    }
  }
});
</script>

<style lang="scss" scoped>
  .reviews {
    @media($mobile) {
      height: 100vh;
      overflow-y: auto;
    }

    &-background {
      position: fixed;
      transform: rotate(-90deg);
      right: -540px;
      z-index: 0;

      @media ($mobile) {
        right: -640px;
      }
    }
  }
</style>
