<i18n src="./Reviews.yml" />
<template>
  <div class="columns reviews">
    <Background
      class="reviews-background"/>
    <div class="column">
      <Heading class="is-red">
        {{ $t('title') }}
      </Heading>
    </div>
    <div class="reviews-content column is-right">
      <Slider
        class="diplomas-section-content"
        :with-button="false"
        :class="{'is-thin': isRussianLocale}"
        :slides="reviews[locale]"/>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue';
import {localeMixin} from '@/components/common/mixins/locale.mixin';
export default Vue.extend({
  name: 'Reviews',
  mixins: [localeMixin],
  computed: {
    reviews() {
      return {
        en: [
          { id: 1,
            name: 'Отзывы',
            text: 'Были с дочкой у психолога в первый раз, возникла практически безвыходная ситуация. После сеанса \n' +
              'разговоры были только о Елене Сергеевне, ребенок просто раскрылся, как-будто сняла с себя тяжелую \n' +
              'ношу, рассказав там о своей проблеме. Спасибо большое Елене Сергеевне, сейчас дочка просто светиться,\n' +
              'стала уверенней себя чувствовать, ждет не дождется следующего посещения!',
            date: 'Марина'
          },
        ],
        ru: [
          {
            id: 2,
            name: 'Отзывы',
            text: 'Я хочу поблагодарить Елену, за ее очень умную и полезную консультацию. ' +
              'На приеме у психолога важным является установление комфортной атмосферы. Елена удивительным образом создает доверительную и профессиональную базу для беседы. После консультации прошло несколько дней — я могу сказать, \n' +
              'что чувствую положительный результат от нашей совместной работы.',
            date: 'Анна'
          },
          {
            id: 3,
            name: 'Отзывы',
            text: 'Я была только на одной консультации, которая была, скорее вводной беседой, поэтому вполне оценить \n' +
              'работу не могу. Но впечатления от консультации остались самые положительные. Некоторые советы \n' +
              'оказались достаточно полезными, я вспоминаю их и пытаюсь применять.',
            date: 'Юлия'
          },
          {
            id: 4,
            name: 'Отзывы',
            text: 'Хочу сказать, что как специалист Елена просто умница. Она мне помогла, помогла навести порядок в моей голове. Спасибо ей большое!',
            date: 'Елена'
          },
          {
            id: 5,
            name: 'Отзывы',
            text: 'Я была только на одной консультации, которая была, скорее вводной беседой, поэтому вполне оценить работу не могу. ' +
              'Но впечатления от консультации остались самые положительные.' +
              ' Некоторые советы оказались достаточно полезными, я вспоминаю их и пытаюсь применять.',
            date: 'Наталья'
          },
          {
            id: 6,
            name: 'Отзывы',
            text: 'Мне всё понравилось. Впечатление о Елене  сложилось приятное. ' +
              'Но, опять же, чтобы почувствовать определенное облегчение, конечно же, ' +
              'необходимо пройти определенный курс бесед. Одна консультация – это мало. При необходимости обращусь снова. Спасибо!',
            date: 'Юлия'
          },
          {
            id: 7,
            name: 'Отзывы',
            text: 'Елена хороший специалист, компетентная, внимательная. ' +
              'Уже на первой консультации установила нужный контакт с ребёнком. ' +
              'Дала нам дельный совет по разрешению проблемы, я очень довольна первой консультацией.',
            date: 'Елена Викторовна'
          },
          {
            id: 8,
            name: 'Отзывы',
            text: 'Консультация у психолога прошла прекрасно. Елена – внимательная, выслушала все,' +
              ' мы подробно обговорили ситуацию, которая меня волновала. ' +
              'Как я читала в отзывах на сайте: люди писали, что от нее уходишь в приподнятом настроении, ' +
              'с ощущением легкости и свободы, вот и у меня то же самое! Мы поговорили, и я специалисту сказала,' +
              ' что я ее выбрала случайно, но и в то же время получилось – не случайно. Мы будем продолжать вместе работать. Спасибо!',
            date: 'Алиса'
          },
          {
            id: 9,
            name: 'Отзывы',
            text: 'Были с сыном пока лишь на первой консультации, но уже замечаю положительные сдвиги. ' +
              'Понравилось, что Елена Сергеевна сразу же смогла установить должный контакт с ребенком.',
            date: 'Дарья'
          },
          {
            id: 10,
            name: 'Отзывы',
            text: 'Консультация специалиста мне понравилась: чувствовала себя уверенно, дискомфорта при общении не испытывала. ' +
              'Психолог внимательно выслушала, дала свои рекомендации.',
            date: 'Мария'
          },
          {
            id: 11,
            name: 'Отзывы',
            text: 'Я хожу к Елене с 2016 года. И это не значит, что у меня вырабаталась привычка и я не могу обходиться без психолога. ' +
              'Хороший психолог, как хороший тренер и наставник, помогает посмотреть на себя в новой перспективе. ' +
              'Я был уверен что хорошо себя знаю, но каждый раз, вместе с Еленой нахожу новые ответы на, как казалось, давно отвеченные вопросы. ' +
              'Этот более широкий вгляд помогает мне во всех областях жизни. Чем дольше я посещаю Елену, ' +
              'тем сложнее становится ее работа, ведь я больше узнаю себя, но Елена, как настоящий профессионал, не перестает прогрессировать ' +
              'и совметная работа с ней не перестает быть плодотворной.',
            date: 'Артур'
          }
        ]
      }
    }
  }
});
</script>

<style lang="scss" scoped>
  .reviews {
    @media($mobile) {
      height: 100vh;
      overflow-y: auto;
    }

    &-background {
      position: fixed;
      transform: rotate(-90deg);
      right: -540px;
      z-index: 0;

      @media ($mobile) {
        right: -640px;
      }
    }
  }
</style>
